Validation_Cases/IncompressibleNACA0012/00/Coarse_SA/system/forceCoeffTrigger
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

runTimeControl1
{
    type            runTimeControl;
    libs            (utilityFunctionObjects);
    controlMode     trigger;
    triggerStart    1;
    conditions
    {
        condition1
        {
            type                average;
            functionObject      forceCoeffs1;
            fields              (Cd Cl);
            tolerance           1e-5;
            window              20;
            windowType          approximate;
        }
    }
}

runTimeControl2
{
    type            runTimeControl;
    libs            (utilityFunctionObjects);
    conditions
    {
        conditions1
        {
            type                maxDuration;
            duration            200;
        }
    }
    satisfiedAction     setTrigger;
    trigger             1;
}

// ************************************************************************* //